1.За какое время работает бинарный поиск? быстрее ли он простого?
   Бинарный поиск работает за O(log n), чем больше список тем быстрее он работает.
2.
3.К какому классу задач относиться задача о коммивояжере?
   NP
4.Что такое асимптотика?
   Асимптоника - оценка времени выполнения алгоритма
5.Почему время выполнения алгоритма не измеряется в секундах?
   На разном железе алгоритм может работать быстрее или медленнее
6.В чём измеряется время выполнения алгоритма?
   В действиях(шагах)
7.Как выражается время выполнения алгоритма?
   O(n) O(log n) O(n log n) O(n2) O(n!)
